/*Задача 27: Напишите функцию и запустите ее, которая принимает
 на вход число и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12*/

/*Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine());

int NumSum(int N)
{
   int b = num%10;
   int result = 0;
   while(b>0)
   {
    num = num/10;
    result = result + b;
   }
   return result;
    
}
Console.WriteLine(NumSum(num));*/ 


int a = 4;
int b = a/10; 
Console.WriteLine($"{b}");


